[
   {
      "date": "2020:05:28",
      "titles": [
         "Marie Harf slams Trump's social media executive order as 'grievance politics', bid to 'troll Twitter'",
         "The top political movies to stream on Amazon Prime Video",
         "US to cancel visas for thousands of Chinese grad students with ties to Chinese military schools: report",
         "Senate Dems raise alarm on 'captured' federal courts as Trump, Republicans keep judicial confirmations coming",
         "Dems abandon vote on bipartisan FISA bill after Trump tweets veto threat",
         "GOP opens up new front in Big Tech censorship fight, hitting Reddit for killing 'The Donald' pro-Trump forum",
         "Biden's support among College Democrats slips amid Tara Reade claims",
         "Nevada Sen. Catherine Cortez Masto withdraws from consideration as Biden's VP pick",
         "Trump signs social media executive order that calls for removal of liability protections over 'censoring'",
         "ICE chief rips ‘dangerous’ move by New York to make sharing illegal immigrant driver data a felony",
         "ICE chief rips ‘dangerous’ move by New York to make sharing illegal immigrant driver data a felony",
         "Trump marks 'sad milestone' as coronavirus deaths reach 100,000 in US",
         "Sen. Tim Kaine and wife test positive for coronavirus antibodies",
         "What's in Trump's executive order on social media?"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:05:29",
      "titles": [
         "Twitter's Jack Dorsey fires back at Zuckerberg, defends fact-checking Trump tweets",
         "Tucker Carlson torches Twitter fact-check of Trump as 'a lie' and 'a form of political censorship'",
         "Trump announces US ‘terminating’ relationship with WHO",
         "Twitter censors Trump's Minneapolis tweet for 'glorifying violence'",
         "Flynn-Kislyak call transcripts released, revealing fateful talks over Russia sanctions",
         "White House hits back after Twitter cracks down on Trump's Minneapolis tweet, reposts censored message",
         "Biden's head-turning comments on Asians resurface amid former VP's attacks on Trump 'xenophobia'",
         "Chicago mayor tells Trump 'F-U' after tweet about Minneapolis looting",
         "Trump seeks to clarify tweet on Minneapolis: 'Looting leads to shooting'",
         "Trump blasts Minneapolis mayor, vows military support if needed",
         "Trump blasts Minneapolis mayor, vows military support if needed",
         "Barr asks US Attorney John Bash to review 'unmasking' before and after 2016 election, DOJ tells Fox News",
         "Conservative groups push diverse slate of GOP House candidates in effort to take back lost ground",
         "Minn. mayor gives masks to crowding rioters after warning in-person worship would be 'public health disaster'",
         "GOP lawmakers push bill to stop states giving stimulus payments to illegal immigrants",
         "Pompeo: All Iran sanctions waivers covering nuclear projects are ending",
         "Sen. Bob Casey reveals positive test for coronavirus antibodies",
         "Minnesota state Democrats postpone convention due to unrest over George Floyd death",
         "Barr says federal investigation of George Floyd ‘proceeding quickly’",
         "Chris Wallace: Twitter going down a dangerous 'slope' with Trump fact-checking"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:05:31",
      "titles": [
         "Susan Rice makes claim Russians could be behind violent George Floyd demonstrations",
         "Big-city Dems who had imposed strict coronavirus lockdowns now let George Floyd rioters flout rules",
         "Trump announces US to designate Antifa as terrorist organization following violent protests",
         "Former NYPD commissioner calls on political leaders to 'get out there' and 'deescalate' violence",
         "Barr: Violence from Antifa, other groups 'is domestic terrorism and will be treated accordingly'",
         "Sen. Ron Johnson says there was 'total corruption' in transition between Obama and Trump administrations",
         "Trump on violent protesters: 'Where are the arrests and long term jail sentences?'",
         "Ex-NBA player J.R. Smith punches, kicks man who allegedly vandalized car during LA George Floyd riots: video",
         "McCarthy says protests, riots about 'more than just George Floyd', Americans have chance to 'solve a problem'",
         "Rep. Emmer blasts Minnesota gov, Minneapolis mayor over response to riots, says they 'let the city burn'",
         "Rep. Emmer blasts Minnesota gov, Minneapolis mayor over response to riots, says they 'let the city burn'"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:06:01",
      "titles": [
         "Son of Minnesota’s attorney general: 'I hereby declare, officially, my support for ANTIFA'",
         "Secret Service agents wounded outside White House, car bombs feared; official says Trump was taken to bunker",
         "Matthew McConaughey says his coronavirus PSAs aren't political move: 'It's about us'",
         "Biden campaign staffers donate to group that bails out jailed Minneapolis protesters: report",
         "Gutfeld blasts Antifa as 'fascists' who are taking 'advantage of the cowardice of our politicians'",
         "Trump vows to mobilize federal resources in address to nation, makes surprise trip to church that caught fire",
         "Trump alleges Biden campaign staff helping get ‘Anarchists out of jail’",
         "First lady Melania Trump condemns riots, urges 'everyone to protest in peace'",
         "Barr sends riot teams to DC, Miami amid violent protests",
         "Trump campaign staffers donate to help Minneapolis firefighter rebuild bar destroyed by rioters",
         "Trump campaign staffers donate to help Minneapolis firefighter rebuild bar destroyed by rioters",
         "Trump unloads on governors over protest response, calls them 'weak'",
         "Michigan Gov. Gretchen Whitmer lifts state's stay-at-home order",
         "Bernie Sanders claims ‘ultra-rich’ have been ‘looting’ America for 40 years",
         "Does Trump bear responsibility for attacks on journalists during George Floyd protests?",
         "Biden says police should be trained to ‘shoot 'em in the leg instead of the heart’",
         "White House establishing ‘central command center’ to combat riots as Trump issues warning",
         "Rector of church near White House set ablaze Sunday night says damage could have been 'a lot worse'",
         "California looters seen fighting over their loot amid George Floyd unrest",
         "Detroit's top cop to George Floyd protesters: 'We understand' hurt, but will be 'relentless' against criminals"
      ],
      "site": "Fox"
   }
]