[
   {
      "date": "2020:05:28",
      "titles": [
         "Marie Harf slams Trump's social media executive order as 'grievance politics', bid to 'troll Twitter'",
         "The top political movies to stream on Amazon Prime Video",
         "US to cancel visas for thousands of Chinese grad students with ties to Chinese military schools: report",
         "Senate Dems raise alarm on 'captured' federal courts as Trump, Republicans keep judicial confirmations coming",
         "Dems abandon vote on bipartisan FISA bill after Trump tweets veto threat",
         "GOP opens up new front in Big Tech censorship fight, hitting Reddit for killing 'The Donald' pro-Trump forum",
         "Biden's support among College Democrats slips amid Tara Reade claims",
         "Nevada Sen. Catherine Cortez Masto withdraws from consideration as Biden's VP pick",
         "Trump signs social media executive order that calls for removal of liability protections over 'censoring'",
         "ICE chief rips ‘dangerous’ move by New York to make sharing illegal immigrant driver data a felony",
         "ICE chief rips ‘dangerous’ move by New York to make sharing illegal immigrant driver data a felony",
         "Trump marks 'sad milestone' as coronavirus deaths reach 100,000 in US",
         "Sen. Tim Kaine and wife test positive for coronavirus antibodies",
         "What's in Trump's executive order on social media?"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:05:29",
      "titles": [
         "Twitter's Jack Dorsey fires back at Zuckerberg, defends fact-checking Trump tweets",
         "Tucker Carlson torches Twitter fact-check of Trump as 'a lie' and 'a form of political censorship'",
         "Trump announces US ‘terminating’ relationship with WHO",
         "Twitter censors Trump's Minneapolis tweet for 'glorifying violence'",
         "Flynn-Kislyak call transcripts released, revealing fateful talks over Russia sanctions",
         "White House hits back after Twitter cracks down on Trump's Minneapolis tweet, reposts censored message",
         "Biden's head-turning comments on Asians resurface amid former VP's attacks on Trump 'xenophobia'",
         "Chicago mayor tells Trump 'F-U' after tweet about Minneapolis looting",
         "Trump seeks to clarify tweet on Minneapolis: 'Looting leads to shooting'",
         "Trump blasts Minneapolis mayor, vows military support if needed",
         "Trump blasts Minneapolis mayor, vows military support if needed",
         "Barr asks US Attorney John Bash to review 'unmasking' before and after 2016 election, DOJ tells Fox News",
         "Conservative groups push diverse slate of GOP House candidates in effort to take back lost ground",
         "Minn. mayor gives masks to crowding rioters after warning in-person worship would be 'public health disaster'",
         "GOP lawmakers push bill to stop states giving stimulus payments to illegal immigrants",
         "Pompeo: All Iran sanctions waivers covering nuclear projects are ending",
         "Sen. Bob Casey reveals positive test for coronavirus antibodies",
         "Minnesota state Democrats postpone convention due to unrest over George Floyd death",
         "Barr says federal investigation of George Floyd ‘proceeding quickly’",
         "Chris Wallace: Twitter going down a dangerous 'slope' with Trump fact-checking"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:05:31",
      "titles": [
         "Susan Rice makes claim Russians could be behind violent George Floyd demonstrations",
         "Big-city Dems who had imposed strict coronavirus lockdowns now let George Floyd rioters flout rules",
         "Trump announces US to designate Antifa as terrorist organization following violent protests",
         "Former NYPD commissioner calls on political leaders to 'get out there' and 'deescalate' violence",
         "Barr: Violence from Antifa, other groups 'is domestic terrorism and will be treated accordingly'",
         "Sen. Ron Johnson says there was 'total corruption' in transition between Obama and Trump administrations",
         "Trump on violent protesters: 'Where are the arrests and long term jail sentences?'",
         "Ex-NBA player J.R. Smith punches, kicks man who allegedly vandalized car during LA George Floyd riots: video",
         "McCarthy says protests, riots about 'more than just George Floyd', Americans have chance to 'solve a problem'",
         "Rep. Emmer blasts Minnesota gov, Minneapolis mayor over response to riots, says they 'let the city burn'",
         "Rep. Emmer blasts Minnesota gov, Minneapolis mayor over response to riots, says they 'let the city burn'"
      ],
      "site": "Fox"
   },
   {
      "date": "2020:06:01",
      "titles": [
         "Son of Minnesota’s attorney general: 'I hereby declare, officially, my support for ANTIFA'",
         "Secret Service agents wounded outside White House, car bombs feared; official says Trump was taken to bunker",
         "Matthew McConaughey says his coronavirus PSAs aren't political move: 'It's about us'",
         "Biden campaign staffers donate to group that bails out jailed Minneapolis protesters: report",
         "Gutfeld blasts Antifa as 'fascists' who are taking 'advantage of the cowardice of our politicians'",
         "Trump vows to mobilize federal resources in address to nation, makes surprise trip to church that caught fire",
         "Trump alleges Biden campaign staff helping get ‘Anarchists out of jail’",
         "First lady Melania Trump condemns riots, urges 'everyone to protest in peace'",
         "Barr sends riot teams to DC, Miami amid violent protests",
         "Trump campaign staffers donate to help Minneapolis firefighter rebuild bar destroyed by rioters",
         "Trump campaign staffers donate to help Minneapolis firefighter rebuild bar destroyed by rioters",
         "Trump unloads on governors over protest response, calls them 'weak'",
         "Michigan Gov. Gretchen Whitmer lifts state's stay-at-home order",
         "Bernie Sanders claims ‘ultra-rich’ have been ‘looting’ America for 40 years",
         "Does Trump bear responsibility for attacks on journalists during George Floyd protests?",
         "Biden says police should be trained to ‘shoot 'em in the leg instead of the heart’",
         "White House establishing ‘central command center’ to combat riots as Trump issues warning",
         "Rector of church near White House set ablaze Sunday night says damage could have been 'a lot worse'",
         "California looters seen fighting over their loot amid George Floyd unrest",
         "Detroit's top cop to George Floyd protesters: 'We understand' hurt, but will be 'relentless' against criminals"
      ],
      "site": "Fox"
   },
   {
      "Date": "2020:06:03",
      "Titles": [
         "White House deletes tweet that falsely identified synagogue anti-terrorism barrier as tool of terrorists",
         "Obama urges young black people to 'feel hopeful even as you may feel angry' after George Floyd's death",
         "Why Trump has the FBI, ICE and TSA patrolling Washington streets",
         "Mattis tears into Trump: 'We are witnessing the consequences of three years without mature leadership'",
         "Spat over NYC protests reignites long running feud between Cuomo and de Blasio",
         "Senate approves House-passed Paycheck Protection Program reform bill",
         "Fact-checking the Rosenstein hearing about the Russia probe",
         "How Barr's experience as AG during the LA riots previewed Trump's actions against protesters",
         "Senate panel approves legislation requiring campaigns to report foreign election help",
         "Rep. Eliot Engel caught on hot mic: 'If I didn't have a primary, I wouldn't care'",
         "Welcome to our reality, white America",
         "Pentagon chief on shaky ground with White House after breaking with Trump over protest response",
         "Rand Paul holds up anti-lynching legislation as he seeks changes to bill",
         "Why women should really worry Trump",
         "READ: Former Defense Secretary Mattis' statement on Trump and protests",
         "Democrats demand Trump administration explain decision to clear protesters from Lafayette Square",
         "Jimmy Carter on George Floyd protests: 'Silence can be as deadly as violence'",
         "The question before the Supreme Court is who polices the police",
         "Nancy Pelosi becomes the latest Democratic lawmaker to visit DC protests",
         "Across the country, young activists take different approaches in the name of justice for George Floyd",
         "Why Ben & Jerry's statement on white supremacy is so extraordinary",
         "Tech group files first lawsuit challenging Trump's social media executive order",
         "READ: Former President Jimmy Carter's statement on the death of George Floyd",
         "As a Christian and a human being, I was appalled by Trump's church photo op",
         "Trump's religious photo-ops aren't about piety. They're about power",
         "Why Joe Biden will almost certainly pick a black woman as VP",
         "Washington Post: Trump attempted to register to vote in Florida last year using the White House address",
         "White House releases results of Trump's annual physical",
         "Rosenstein acknowledges problems with FBI's Russia probe but defends Mueller's appointment",
         "Amazon's best sellers list is dominated almost entirely by books on race right now",
         "US to block Chinese airlines from flying into the US",
         "Anti-gay viral video stirs outrage ahead of Russian referendum",
         "Trump risks potential backlash from evangelicals with 'tone-deaf' Bible photo-op",
         "Donald Trump's 'bunker' story tells you everything you need to know about him",
         "Biden campaign turns speech on nation's unrest into battleground digital ad",
         "The real reason Steve King lost",
         "Chances look slim for Congress to overhaul policing laws any time soon",
         "DC National Guard investigating actions by its low-flying helicopters during Monday night protests",
         "Trump launches defensive Twitter spree as America grieves",
         "Minnesota governor personally apologizes to CNN reporter arrested while covering protests",
         "Trump claims he went to bunker for 'inspection' amid violent protests",
         "READ: Former Deputy Attorney General Rod Rosenstein's opening statement before Senate Judiciary Committee",
         "Fired State Department watchdog answers lawmakers' questions for nearly 7 hours",
         "'You just don't do that, Mr. President': Televangelist Pat Robertson condemns Trump's 'law and order' response to protests",
         "US black-white inequality in 6 stark charts",
         "'We need him to start being bold:' Young voters are craving inspiration from Joe Biden",
         "Trump and Biden clash as George Floyd's killing jolts 2020 race",
         "New York City Mayor de Blasio says Gov. Cuomo owes NYPD an apology",
         "Political advertising grows on streaming services, along with questions about disclosure",
         "Incumbents usually are penalized in times of unrest",
         "Ferguson elects first black mayor in city's history nearly six years after protests solidified Black Lives Matter movement",
         "What my Florida town can teach us about racist policing"
      ],
      "Site": "CNN"
   },
   {
      "Date": "2020:06:02",
      "Titles": [
         "Coronavirus pandemic: Updates from around the world",
         "George W. Bush on George Floyd protests: 'It is time for America to examine our tragic failures'",
         "Steve King loses primary. His opponents argue it's because of his powerlessness.",
         "Why this 'sick to my stomach' quote proves exactly what is wrong with the Trump White House",
         "8 words that reveal Republicans' total complicity with Trump",
         "Trump says GOP forced to find new state to host convention as North Carolina stands by coronavirus measures",
         "Teresa Leger Fernandez defeats ex-CIA operative Valerie Plame in competitive primary for US House seat in New Mexico",
         "Live or virtual conventions? Texas parties may preview national split",
         "Official resigns from Pentagon advisory board over Esper's perceived support for clearing protest outside White House",
         "60 minutes of mayhem: How aggressive politics and policing turned a peaceful protest into a violent confrontation",
         "1,600 active-duty troops sent to Washington area after some governors turn down request for National Guard",
         "US and South Korea reach agreement to fund Koreans working for US Forces Korea",
         "We're 22 weeks into 2020. The next 22 could feel like another eternity",
         "Polling highlights stark gap in trust of police between black and white Americans",
         "Former Joint Chiefs chairman rips Trump's threat of military force: 'Our fellow citizens are not the enemy'",
         "DC and Philly leaders say curfews won't get in the way of voting",
         "Top Republican senators defend Trump's church photo-op after peaceful protesters cleared out",
         "Former minister at church used for Trump's photo-op: 'It was a sacrilege for all people of all faiths'",
         "Plans being discussed for Joe Biden to attend George Floyd's funeral",
         "READ: Former President George W. Bush's statement on the death of George Floyd",
         "Premier League players urged to take a knee in protest at George Floyd's death",
         "Biden sharpens contrast with Trump: 'I won't traffic in fear and division'",
         "Republicans divided over fixes for small business Paycheck Protection Program",
         "2020 primaries: 5 things to watch today as 8 states go to the polls",
         "Attorney General Barr ordered authorities to clear protesters near White House, DOJ official says",
         "Air Force commander calls George Floyd's death 'a national tragedy'",
         "A pandemic, pay cuts and furloughs. And that was just the first month for BuzzFeed News' new editor",
         "Cuomo calls New York City's response to looting and damage 'inexcusable'",
         "Analysis of changing electorate shows a divided and partisan America that could grow even further apart",
         "Surgeon General warns of coronavirus outbreaks from Floyd protests",
         "The long, dark history of Donald Trump's pledge to be a 'law and order' president",
         "How past US presidents engaged with activists and mass protests",
         "Pelosi cites Ecclesiastes in response to Trump, says it is a time for healing",
         "Trump, an infrequent churchgoer, focuses on Christian base amid protests and pandemic",
         "Gutted newsrooms juggle pandemic and protests: 'I volunteered because somebody has to sleep sometime'",
         "READ: Joe Biden's remarks on civil unrest and nationwide protests",
         "One of America's most prominent conservative columnists wants Republicans to lose in 2020",
         "How Atlanta's mayor became the face and voice of her party amid protest and chaos",
         "DC mayor says she's 'shocked' and 'outraged' at treatment of peaceful protesters at White House",
         "Donald Trump's twisted definition of toughness",
         "Top Air Force enlistee posts passionate plea for justice",
         "Trump responds to protests with a strongman act",
         "Bernie Sanders tries on a new role in 2020: Inside player"
      ],
      "Site": "CNN"
   },
   {
      "Date": "2015:04:05",
      "Titles": [
         "Controversial Police Encounters Fast Facts"
      ],
      "Site": "CNN"
   },
   {
      "Date": "2020:06:01",
      "Titles": [
         "Pentagon officials express concern as Trump threatens to use military to 'dominate' protestors",
         "Can Trump legally deploy US troops to US cities?",
         "Bishop at DC church outraged by Trump visit: 'I just can't believe what my eyes have seen'",
         "GOP senators critical of Trump's response to unrest following Floyd's death",
         "Atlanta mayor trying to strike 'tough balance' between criticizing police and supporting well-intentioned ones amid protests"
      ],
      "Site": "CNN"
   },
   {
      "Date": "2013:11:16",
      "Titles": [
         "Newt Gingrich Fast Facts"
      ],
      "Site": "CNN"
   }
]